In [1]:
import pandas as pd
from matplotlib import pyplot as plt
import numpy as np

# Credit Card

In [2]:
credit_card_df = pd.read_excel('./data/dataset/CREDIT CARD TXNS_PJDSC.xlsx')
credit_card_df.head()

,CUST_NUM,MERCH_GROUP,DATE,AMOUNT,CHANNEL,MERCH_NAME,COUNTRY
0,3016.966026,Retail Outlet Services,2023-04-01,3211.528727,POS-RETAIL PURCHASE,MERCHANT 1,PH
1,3016.966026,Clothing Stores,2023-04-01,3982.218215,POS-RETAIL PURCHASE,MERCHANT 2,PH
2,3016.966026,Miscellaneous Stores,2023-04-18,872.539734,POS-RETAIL PURCHASE,MERCHANT 3,PH
3,3016.966026,Miscellaneous Stores,2023-04-27,390.082187,POS-RETAIL PURCHASE,MERCHANT 4,PH
4,3016.966026,Retail Outlet Services,2023-04-29,4956.055464,ONLINE-RETAIL PURCHASE,MERCHANT 5,PH

In [3]:
credit_card_df.shape

(33126, 7)

In [7]:
for i in credit_card_df.columns:
    print(f'{i}: {credit_card_df[i].nunique()}')

CUST_NUM: 2143
MERCH_GROUP: 12
DATE: 91
AMOUNT: 33126
CHANNEL: 3
MERCH_NAME: 3008
COUNTRY: 40

In [9]:
credit_card_df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 33126 entries, 0 to 33125
Data columns (total 7 columns):
 #   Column       Non-Null Count  Dtype
---  ------       --------------  -----
 0   CUST_NUM     33126 non-null  float64
 1   MERCH_GROUP  31558 non-null  object
 2   DATE         33126 non-null  datetime64[ns]
 3   AMOUNT       33126 non-null  float64
 4   CHANNEL      33126 non-null  object
 5   MERCH_NAME   33126 non-null  object
 6   COUNTRY      31877 non-null  object
dtypes: datetime64[ns](1), float64(2), object(4)
memory usage: 1.8+ MB

# Customer Info

In [11]:
customer_info_df = pd.read_excel('./data/dataset/CUSTOMER INFO_PJDSC.xlsx')
customer_info_df.head()

,CUST_NUM,PROVINCE,REGION,EDUCATION,AGE,TENURE,BUSINESS_OWNER,DIGITAL_FLAG,INCOME_SOURCE,IDV_OR_ORG,SEGMENT,SUBSEGMENT,GENDER,MARITAL_STATUS
0,11712.654012,BENGUET,CORDILLERA ADMINISTRATIVE REGION (CAR),NO_DATA,20.0,1.833333,N,DIGITAL,ALLOWANCE,1,3,CORE MASS,MALE,SINGLE
1,436.605085,BENGUET,CORDILLERA ADMINISTRATIVE REGION (CAR),NO_DATA,21.0,4.250000,N,NO_DATA,SALARY,1,3,CORE MASS,FEMALE,SINGLE
2,921.989154,BENGUET,CORDILLERA ADMINISTRATIVE REGION (CAR),NO_DATA,23.0,2.000000,N,TRADITIONAL,ALLOWANCE,1,3,CORE MASS,MALE,SINGLE
3,1119.634762,BENGUET,CORDILLERA ADMINISTRATIVE REGION (CAR),LOW,13.0,5.583333,N,TRADITIONAL,ALLOWANCE,1,3,CORE MASS,MALE,SINGLE
4,1709.755538,BENGUET,CORDILLERA ADMINISTRATIVE REGION (CAR),NO_DATA,20.0,1.250000,N,DIGITAL,SALARY,1,3,CORE MASS,FEMALE,SINGLE

In [18]:
customer_info_df.shape

(138444, 14)

In [44]:
customer_info_df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 138444 entries, 0 to 138443
Data columns (total 11 columns):
 #   Column          Non-Null Count   Dtype
---  ------          --------------   -----
 0   CUST_NUM        138444 non-null  float64
 1   PROVINCE        138444 non-null  object
 2   REGION          138444 non-null  object
 3   EDUCATION       138444 non-null  object
 4   AGE             138378 non-null  float64
 5   TENURE          138444 non-null  float64
 6   BUSINESS_OWNER  138444 non-null  object
 7   DIGITAL_FLAG    138444 non-null  object
 8   INCOME_SOURCE   138444 non-null  object
 9   GENDER          138444 non-null  object
 10  MARITAL_STATUS  138444 non-null  object
dtypes: float64(3), object(8)
memory usage: 11.6+ MB

In [47]:
customer_info_df.describe(include='all')

,CUST_NUM,PROVINCE,REGION,EDUCATION,AGE,TENURE,BUSINESS_OWNER,DIGITAL_FLAG,INCOME_SOURCE,GENDER,MARITAL_STATUS
count,138444.000000,138444,138444,138444,138378.000000,138444.000000,138444,138444,138444,138444,138444
unique,NaN,45,14,4,NaN,NaN,2,3,12,3,6
top,NaN,NEGROS OCCIDENTAL,REGION VI (WESTERN VISAYAS),MID,NaN,NaN,N,TRADITIONAL,SALARY,FEMALE,SINGLE
freq,NaN,13488,20508,63396,NaN,NaN,131553,64695,84531,80298,80310
mean,9424.785491,NaN,NaN,NaN,40.255496,6.280592,NaN,NaN,NaN,NaN,NaN
std,3337.146487,NaN,NaN,NaN,15.712651,5.241069,NaN,NaN,NaN,NaN,NaN
min,85.229103,NaN,NaN,NaN,1.000000,0.083333,NaN,NaN,NaN,NaN,NaN
25%,7064.942498,NaN,NaN,NaN,28.000000,2.166667,NaN,NaN,NaN,NaN,NaN
50%,10000.653129,NaN,NaN,NaN,36.000000,5.083333,NaN,NaN,NaN,NaN,NaN
75%,12247.160446,NaN,NaN,NaN,49.000000,9.000000,NaN,NaN,NaN,NaN,NaN
max,14141.980201,NaN,NaN,NaN,122.000000,30.416667,NaN,NaN,NaN,NaN,NaN

In [24]:
for i in customer_info_df.columns:
    print(f'{i}: {customer_info_df[i].unique()}')

CUST_NUM: 46148
PROVINCE: 45
REGION: 14
EDUCATION: 4
AGE: 106
TENURE: 307
BUSINESS_OWNER: 2
DIGITAL_FLAG: 3
INCOME_SOURCE: 12
IDV_OR_ORG: 1
SEGMENT: 1
SUBSEGMENT: 1
GENDER: 3
MARITAL_STATUS: 6

We can remove all other features that only contains one value (IDV_OR_ORG, SEGMENT, SUBSEGMENT).

In [42]:
customer_info_df.drop(labels=['IDV_OR_ORG', 'SEGMENT','SUBSEGMENT'],axis=1,inplace=True)

In [43]:
customer_info_df.columns

Index(['CUST_NUM', 'PROVINCE', 'REGION', 'EDUCATION', 'AGE', 'TENURE',
       'BUSINESS_OWNER', 'DIGITAL_FLAG', 'INCOME_SOURCE', 'GENDER',
       'MARITAL_STATUS'],
      dtype='object')

# Debit Card

In [12]:
debit_card_df = pd.read_excel('./data/dataset/DEBIT CARD TXNS_PJDSC.xlsx')
debit_card_df.head()

      CUST_NUM CHANNEL       DATE   TIME        AMOUNT
0  3659.137057     POS 2023-04-01  39958  30001.039678
1  3659.137057     POS 2023-04-04  51349  20001.662634
2  3659.137057     POS 2023-04-05  42803  22001.514584
3  3659.137057     POS 2023-04-06  51455  30001.529392
4  3659.137057     POS 2023-04-11  62752  22001.092602

In [19]:
debit_card_df.shape

(369594, 5)

In [26]:
for i in debit_card_df.columns:
    print(f'{i}: {debit_card_df[i].nunique()}')

CUST_NUM: 25618
CHANNEL: 2
DATE: 92
TIME: 67455
AMOUNT: 369594

In [27]:
for i in debit_card_df.columns:
    print(f'{i}: {debit_card_df[i].isna().sum()}')

CUST_NUM: 0
CHANNEL: 0
DATE: 0
TIME: 0
AMOUNT: 0

# Financial Digital

In [13]:
financial_digital_df = pd.read_excel('./data/dataset/FINANCIAL DIGITAL TXNS_PJDSC.xlsx')
financial_digital_df.head()

       CUST_NUM       AMOUNT       DATE_AND_TIME CHANNEL      TRAN_TYPE
0   4418.325475  2000.885936 2023-04-01 07:55:10  MOBILE       E-WALLET
1   4418.325475  2000.407658 2023-04-01 07:54:01  MOBILE       E-WALLET
2   4418.325475  9829.356544 2023-04-14 11:04:20  MOBILE  BILLS PAYMENT
3   7356.780546  2000.575996 2023-04-11 09:41:43  MOBILE       E-WALLET
4  10768.575579   100.667732 2023-04-02 20:36:51     WEB       E-WALLET

In [20]:
financial_digital_df.head()

       CUST_NUM       AMOUNT       DATE_AND_TIME CHANNEL      TRAN_TYPE
0   4418.325475  2000.885936 2023-04-01 07:55:10  MOBILE       E-WALLET
1   4418.325475  2000.407658 2023-04-01 07:54:01  MOBILE       E-WALLET
2   4418.325475  9829.356544 2023-04-14 11:04:20  MOBILE  BILLS PAYMENT
3   7356.780546  2000.575996 2023-04-11 09:41:43  MOBILE       E-WALLET
4  10768.575579   100.667732 2023-04-02 20:36:51     WEB       E-WALLET

In [28]:
for i in financial_digital_df.columns:
    print(f'{i}: {financial_digital_df[i].nunique()}')

CUST_NUM: 10160
AMOUNT: 174613
DATE_AND_TIME: 172043
CHANNEL: 4
TRAN_TYPE: 3

In [29]:
for i in financial_digital_df.columns:
    print(f'{i}: {financial_digital_df[i].isna().sum()}')

CUST_NUM: 0
AMOUNT: 0
DATE_AND_TIME: 0
CHANNEL: 0
TRAN_TYPE: 0

# Incoming Instapay

In [14]:
incoming_instapay_df = pd.read_excel('./data/dataset/INCOMING INSTAPAY TXNS_PJDSC.xlsx')
incoming_instapay_df.head()

      CUST_NUM       DATE   TIME        AMOUNT BPI_ACCT_TYPE SRC_BANK_NAME
0  5713.401964 2023-04-01  73591  12299.238264            SA         LEMUR
1  5713.401964 2023-04-05  44714   2499.424915            SA         HUMAN
2  5713.401964 2023-04-24  46302    748.744684            SA         HUMAN
3  5713.401964 2023-04-29  40612   1799.144167            SA         HUMAN
4  5713.401964 2023-04-29  24021   1499.628880            SA         HUMAN

In [21]:
incoming_instapay_df.shape

(80042, 6)

In [30]:
for i in incoming_instapay_df.columns:
    print(f'{i}: {incoming_instapay_df[i].nunique()}')

CUST_NUM: 12929
DATE: 91
TIME: 47447
AMOUNT: 80042
BPI_ACCT_TYPE: 2
SRC_BANK_NAME: 49

In [31]:
for i in incoming_instapay_df.columns:
    print(f'{i}: {incoming_instapay_df[i].isna().sum()}')

CUST_NUM: 0
DATE: 0
TIME: 0
AMOUNT: 0
BPI_ACCT_TYPE: 0
SRC_BANK_NAME: 0

# Outgoing Instapay

In [15]:
outgoing_instapay_df = pd.read_excel('./data/dataset/OUTGOING INSTAPAY TXNS_PJDSC.xlsx')
outgoing_instapay_df.head()

       CUST_NUM       DATE   TIME       AMOUNT CHANNEL RCV_BANK_NAME
0  12844.855858 2023-04-01  68284   999.858929  MOBILE         HUMAN
1  12844.855858 2023-04-01  70887  1999.472786  MOBILE         HUMAN
2  12844.855858 2023-04-02  14934  5099.594826  MOBILE         HUMAN
3  12844.855858 2023-04-02  14025  1799.585649  MOBILE         HUMAN
4  12844.855858 2023-04-04   5845  4299.349369  MOBILE         HUMAN

In [23]:
outgoing_instapay_df.shape

(40829, 6)

In [32]:
for i in outgoing_instapay_df.columns:
    print(f'{i}: {outgoing_instapay_df[i].nunique()}')

CUST_NUM: 6230
DATE: 91
TIME: 30899
AMOUNT: 40829
CHANNEL: 2
RCV_BANK_NAME: 54

In [33]:
for i in outgoing_instapay_df.columns:
    print(f'{i}: {outgoing_instapay_df[i].isna().sum()}')

CUST_NUM: 0
DATE: 0
TIME: 0
AMOUNT: 0
CHANNEL: 0
RCV_BANK_NAME: 0

# Questions

1. How many Core Mass clients from Sultan Kudarat are in the Customer Info dataset?

In [15]:
customer_info_df.groupby(['PROVINCE']).size()

PROVINCE
AGUSAN DEL NORTE                   2364
AGUSAN DEL SUR                      402
AKLAN                              3102
ALBAY                              3546
ANTIQUE                            1284
BATAAN                             2727
BENGUET                            8214
BOHOL                              4206
BUKIDNON                           2319
CAGAYAN                            3111
CAMARINES NORTE                    1098
CAMARINES SUR                      4044
CAPIZ                              2634
COTABATO (NORTH COTABATO)          1191
COTABATO CITY (NOT A PROVINCE)     1017
DAVAO DEL NORTE                    3432
DAVAO ORIENTAL                      453
ILOCOS NORTE                       3363
ILOCOS SUR                         1893
ISABELA                            3792
LA UNION                           3462
LANAO DEL NORTE                    2460
LEYTE                              4845
MISAMIS OCCIDENTAL                 1497
MISAMIS ORIENTAL                   9783
NEGROS OCCIDENTAL                 13488
NEGROS ORIENTAL                    5034
NORTHERN SAMAR                      351
NUEVA ECIJA                        4836
NUEVA VIZCAYA                      1119
OCCIDENTAL MINDORO                    9
ORIENTAL MINDORO                   1044
PALAWAN                            2397
PANGASINAN                         8841
SAMAR (WESTERN SAMAR)               246
SORSOGON                            945
SOUTH COTABATO                     5262
SOUTHERN LEYTE                      402
SULTAN KUDARAT                      462
SURIGAO DEL NORTE                  1068
SURIGAO DEL SUR                     309
TARLAC                             4020
ZAMBALES                           5742
ZAMBOANGA DEL NORTE                1320
ZAMBOANGA DEL SUR                  5310
dtype: int64

Based from the `groupby()` operation done above, there are 462 Core Mass clients from Sultan Kudarat.

2. In May 2023, what was the total financial digital transaction amount produced by Core Mass clients?

In [ ]:
financial_digital_df.groupby('')

3. What bank was most frequently treated as recipient by Core Mass for their outgoing Instapay transactions?

4. What are the top three countries wherein Core Mass clients performed credit card transactions most frequently?

5. For each dataset, which columns contain null values?

Only two datasets contains `NULL` values. The `credit_card` dataset had two columns containing `NULL` values, MERCH_GROUP and COUNTRY. The second dataset was the `customer_info` dataset. It only had null values on the AGE column.